-- MCR Greet V 0.93 --
if (GetLocale() == "ruRU") then
	print("McR Greet: Приветствие загружено на русском языке.");
	ClientLanguage = "set";

-- Definition of the texts as an array or table
	DayTXT =	{
				"Привет",
				"Привет ребята",
		 		"Привет всем",
		 		"Добрый день",
		 		"Здорово!"
            	 };  
    
    EveTXT =	{
				"Буэнас Ночес!",
				"Добрый вечер всем!",
				"Привет",
				"Здорово",
				"Добрый вечер"
             	};
    
    MorTXT = 	{
    	    	"с добрым утром",
				"Привет",
				"Здорово",
				"привет ребята",
				"привет всем"",
             	};
    
    NooTXT = 	{
        		"приятного аппетита",
				"приятного"
             	};
end;
